Reading Data From Different Sources

In [7]:
pip install stringIO

Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution -atplotlib (c:\users\allif\appdata\local\programs\python\python39\lib\site-packages)
ERROR: Could not find a version that satisfies the requirement stringIO (from versions: none)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip
ERROR: No matching distribution found for stringIO

In [13]:
import pandas as pd
from io import StringIO


data = '''{
  "employees_names":    ["John",       "Anna",            "Peter",           "Linda"],
  "job_profile":        ["Team Leader","Project Manager","Software Engineer","Data Analyst"],
  "employees":          [1,            2,                 3,                 4],
  "employees_salaries": [1000,         1500,              2000,              2500]
}'''


#convert json to string IO
df = pd.read_json(StringIO(data))

In [14]:
df

  employees_names        job_profile  employees  employees_salaries
0            John        Team Leader          1                1000
1            Anna    Project Manager          2                1500
2           Peter  Software Engineer          3                2000
3           Linda       Data Analyst          4                2500

In [16]:
#convert csv to json
df.to_json() #convert json to csv

'{"employees_names":{"0":"John","1":"Anna","2":"Peter","3":"Linda"},"job_profile":{"0":"Team Leader","1":"Project Manager","2":"Software Engineer","3":"Data Analyst"},"employees":{"0":1,"1":2,"2":3,"3":4},"employees_salaries":{"0":1000,"1":1500,"2":2000,"3":2500}}'

In [17]:
#convert json based on record
df.to_json(orient='index') #convert json based on records

'{"0":{"employees_names":"John","job_profile":"Team Leader","employees":1,"employees_salaries":1000},"1":{"employees_names":"Anna","job_profile":"Project Manager","employees":2,"employees_salaries":1500},"2":{"employees_names":"Peter","job_profile":"Software Engineer","employees":3,"employees_salaries":2000},"3":{"employees_names":"Linda","job_profile":"Data Analyst","employees":4,"employees_salaries":2500}}'

In [18]:
#extracting csv from website

df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/airtravel.csv', header=None)

In [19]:
df.head()

       0        1        2        3
0  Month   "1958"   "1959"   "1960"
1    JAN      340      360      417
2    FEB      318      342      391
3    MAR      362      406      419
4    APR      348      396      461

In [20]:
##convert the airtravel data to csv
df.to_csv('airtravel.csv', index=False, header=False)

In [22]:
!pip install 1xml
!pip install html5lib

WARNING: Ignoring invalid distribution -atplotlib (c:\users\allif\appdata\local\programs\python\python39\lib\site-packages)
ERROR: Could not find a version that satisfies the requirement 1xml (from versions: none)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip
ERROR: No matching distribution found for 1xml

Requirement already satisfied: html5lib in c:\users\allif\appdata\local\programs\python\python39\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\allif\appdata\roaming\python\python39\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\allif\appdata\local\programs\python\python39\lib\site-packages (from html5lib) (0.5.1)

WARNING: Ignoring invalid distribution -atplotlib (c:\users\allif\appdata\local\programs\python\python39\lib\site-packages)
WARNING: Ignoring invalid distribution -atplotlib (c:\users\allif\appdata\local\programs\python\python39\lib\site-packages)
WARNING: Ignoring invalid distribution -atplotlib (c:\users\allif\appdata\local\programs\python\python39\lib\site-packages)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [24]:
##reading data from html file 
url = "https://www.fdic.gov/bank/individual/failed/banklist.html"

#read the html file
df = pd.read_html(url)

#see the data
df[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544

In [25]:
#extracting the data from html file from wikipedia
# the Wikipedia page with the Mobile Country Code listings
url = "https://en.wikipedia.org/wiki/Mobile_country_code"

#read the html file
df = pd.read_html(url, match="Country", header=0)

#see the data
df[0].head()

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN